## Central account
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 9 to add, 2 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.log_archive_bucket will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "log_archive_bucket"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:ObjectOwnerOverrideToBucketOwner",
              + "s3:ReplicateDelete",
              + "s3:ReplicateObject",
            ]
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + "arn:aws:iam::722713121070:role/CbsSatelliteReplicateToLogArchive",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "s3:GetBucketVersioning",
              + "s3:List*",
              + "s3:PutBucketVersioning",
            ]
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + "arn:aws:iam::722713121070:role/CbsSatelliteReplicateToLogArchive",
                ]
              + type        = "AWS"
            }
        }
    }

  # data.aws_iam_policy_document.log_archive_read will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "log_archive_read"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:ListBucket",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "kms:Decrypt",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # aws_iam_policy.log_archive_read will be created
  + resource "aws_iam_policy" "log_archive_read" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "CbsLogArchiveBucketRead"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_role.log_archive_read will be created
  + resource "aws_iam_role" "log_archive_read" {
      + arn                   = (known after apply)
      + assume_role_policy    = (sensitive)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "CbsLogArchiveBucketRead"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.log_archive_read will be created
  + resource "aws_iam_role_policy_attachment" "log_archive_read" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "CbsLogArchiveBucketRead"
    }

  # aws_kms_key.log_archive_encrypt will be created
  + resource "aws_kms_key" "log_archive_encrypt" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "Encrypt objects in the log-archive S3 bucket"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (sensitive)
      + tags_all                           = (known after apply)
    }

  # aws_s3_bucket_policy.log_archive_bucket will be created
  + resource "aws_s3_bucket_policy" "log_archive_bucket" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.gh_oidc_roles.data.aws_iam_policy_document.assume_role_policy[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "assume_role_policy"  {
      ~ id                      = "4087619814" -> (known after apply)
      ~ json                    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringLike = {
                              - token.actions.githubusercontent.com:sub = [
                                  - "repo:cds-snc/cloud-based-sensor:ref:refs/heads/main",
                                ]
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::339850311124:oidc-provider/token.actions.githubusercontent.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ source_policy_documents = [
          - jsonencode(
                {
                  - Statement = [
                      - {
                          - Action    = "sts:AssumeRoleWithWebIdentity"
                          - Condition = {
                              - StringLike = {
                                  - token.actions.githubusercontent.com:sub = "repo:cds-snc/cloud-based-sensor:ref:refs/heads/main"
                                }
                            }
                          - Effect    = "Allow"
                          - Principal = {
                              - Federated = "arn:aws:iam::339850311124:oidc-provider/token.actions.githubusercontent.com"
                            }
                          - Sid       = ""
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ),
          - jsonencode({}),
          + (known after apply),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action    = "sts:AssumeRole"
                          + Effect    = "Allow"
                          + Principal = {
                              + AWS = "arn:aws:iam::722713121070:role/ConfigTerraformAdminExecutionRole"
                            }
                          + Sid       = ""
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
        ]
      - version                 = "2012-10-17" -> null
    }

  # module.gh_oidc_roles.data.aws_iam_policy_document.oidc_assume_role_policy[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "oidc_assume_role_policy"  {
      ~ id      = "3892153364" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringLike = {
                              - token.actions.githubusercontent.com:sub = "repo:cds-snc/cloud-based-sensor:ref:refs/heads/main"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::339850311124:oidc-provider/token.actions.githubusercontent.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
          - resources     = [] -> null
            # (2 unchanged attributes hidden)

          + condition {
              + test     = "StringLike"
              + values   = [
                  + "repo:cds-snc/cloud-based-sensor:*",
                ]
              + variable = "token.actions.githubusercontent.com:sub"
            }
          - condition {
              - test     = "StringLike" -> null
              - values   = [
                  - "repo:cds-snc/cloud-based-sensor:ref:refs/heads/main",
                ] -> null
              - variable = "token.actions.githubusercontent.com:sub" -> null
            }

            # (1 unchanged block hidden)
        }
    }

  # module.gh_oidc_roles.aws_iam_openid_connect_provider.github will be updated in-place
  ~ resource "aws_iam_openid_connect_provider" "github" {
        id              = "arn:aws:iam::339850311124:oidc-provider/token.actions.githubusercontent.com"
      ~ tags            = {
          ~ "CostCentre" = "cbs-central" -> "cbs-339850311124"
            # (1 unchanged element hidden)
        }
      ~ tags_all        = {
          ~ "CostCentre" = "cbs-central" -> "cbs-339850311124"
            # (1 unchanged element hidden)
        }
        # (4 unchanged attributes hidden)
    }

  # module.gh_oidc_roles.aws_iam_role.this[0] will be updated in-place
  ~ resource "aws_iam_role" "this" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringLike = {
                              - token.actions.githubusercontent.com:sub = "repo:cds-snc/cloud-based-sensor:*"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::339850311124:oidc-provider/token.actions.githubusercontent.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "ConfigTerraformAdministratorRole"
        name                  = "ConfigTerraformAdministratorRole"
      ~ tags                  = {
          ~ "CostCentre" = "cbs-central" -> "cbs-339850311124"
            # (1 unchanged element hidden)
        }
      ~ tags_all              = {
          ~ "CostCentre" = "cbs-central" -> "cbs-339850311124"
            # (1 unchanged element hidden)
        }
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.log_archive_access_bucket.aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "cbs-log-archive-339850311124-access"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "CostCentre" = "cbs-339850311124"
          + "Terraform"  = "true"
        }
      + tags_all                    = {
          + "CostCentre" = "cbs-339850311124"
          + "Terraform"  = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # module.log_archive_access_bucket.aws_s3_bucket_public_access_block.this will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.log_archive_bucket.aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "cbs-log-archive-339850311124"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "CostCentre" = "cbs-339850311124"
          + "Terraform"  = "true"
        }
      + tags_all                    = {
          + "CostCentre" = "cbs-339850311124"
          + "Terraform"  = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + lifecycle_rule {
          + enabled = true
          + id      = "delete-old-objects"

          + expiration {
              + days = 14
            }
        }

      + logging {
          + target_bucket = (known after apply)
        }

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + kms_master_key_id = (known after apply)
                  + sse_algorithm     = (known after apply)
                }
            }
        }

      + versioning {
          + enabled    = true
          + mfa_delete = false
        }
    }

  # module.log_archive_bucket.aws_s3_bucket_public_access_block.this will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

Plan: 9 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.log_archive_read"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.log_archive_read"]
WARN - plan.json - main - Missing Common Tags: ["aws_kms_key.log_archive_encrypt"]

11 tests, 8 passed, 3 warnings, 0 failures, 0 exceptions

```

</details>
